База_Back/src/Catalogs/отусВиртуальныеКарты/отусВиртуальныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>отусВиртуальныеКарты</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодарочныйСертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

База_Back/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Улица</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Факс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВебСайт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.отусТипКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

База_Back/src/CommonForms/отусНоваяКарта/Module.bsl
&НаСервере
Процедура СохранитьНаСервере()
			
	Если Не ЗначениеЗаполнено(Справочники.отусВиртуальныеКарты.НайтиКарту(Телефон).Карта) Тогда  
		Попытка
			НачатьТранзакцию();
			Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
			Контрагент.Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Физ лица"); 
			Контрагент.Фамилия = Фамилия;
			Контрагент.Имя = Имя; 
			Контрагент.Наименование = СтрШаблон("%1 %2", Фамилия, Имя);
			Контрагент.ВидЦен = Справочники.ВидыЦен.НайтиПоНаименованию("Розничная");
			Контрагент.Телефон = Телефон;
			
			Контрагент.Записать();
			
			НоваяКарта = Справочники.отусВиртуальныеКарты.СоздатьЭлемент();
			НоваяКарта.Контрагент = Контрагент.Ссылка;
			НоваяКарта.НомерКарты = Новый УникальныйИдентификатор;
			НоваяКарта.Наименование = СтрШаблон("%1 (%2)", Контрагент.Наименование, НоваяКарта.НомерКарты); 
			НоваяКарта.ПодарочныйСертификат = ПодарочныйСертификат;
			НоваяКарта.Сумма = Сумма;
			НоваяКарта.Записать();
			
			ЗафиксироватьТранзакцию(); 
			Сообщить("Карта создана");
		Исключение
			ОтменитьТранзакцию(); 
			Сообщить("ошибка создания карты");
		КонецПопытки;
	Иначе
		Сообщить(СтрШаблон("На телефон %1 уже зарегистрирована виртуальная карта", Телефон));
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	
	ДанныеЗакрытия = Новый Структура;
	ДанныеЗакрытия.Вставить("ПодарочныйСертификат");
	ДанныеЗакрытия.Вставить("Сумма");
	ЗаполнитьЗначенияСвойств(ДанныеЗакрытия, ЭтотОбъект);

	Закрыть(ДанныеЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодарочныйСертификатПриИзменении(Элемент)
	
	Если ПодарочныйСертификат Тогда
		Элементы.Сумма.Видимость = Истина;
	КонецЕсли;	
		
	
КонецПроцедуры
